Revit 2026 API

# ExternalResourceLoadData Class

---

This class contains the input and output data resulting from invoking an IExternalResourceServer's LoadResource method.

After the call to LoadResource, the resulting ExternalResourceLoadData will be passed into IExternalResourceServer.HandleLoadResourceResults() so that appropriate UI can be displayed.

Server providers can inspect the ExternalResourceLoadData to get an ExternalResourceLoadContent object of the subclass appropriate to the external resource. The class also contains a copy of the ExternalResourceReference, and information about the context of the load operation.

SystemObject Autodesk.Revit.DBExternalResourceLoadData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalResourceLoadData : IDisposable
```
```vb
Public Class ExternalResourceLoadData
	Implements IDisposable
```
```cpp
public ref class ExternalResourceLoadData : IDisposable
```
```fsharp
type ExternalResourceLoadData =
    class
        interface IDisposable
    end
```

The ExternalResourceLoadData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ErrorsReported | Indicates whether the IExternalResourceUIServer has reported errors for this ExternalResourceLoadData. This value can be set by the IExternalResourceUIServer in HandleLoadResourceResults(). |
|  | ExternalResourceType | The ExternalResourceType for which Revit is requesting data from the server. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LoadStatus | The success or failure status of the load attempt. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalResourceLoadData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExternalResourceReference | Returns the ExternalResourceReference that identifies which resource should be loaded. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLoadContent | Returns the ExternalResourceLoadContent resulting from this load operation. |
|  | GetLoadContext | Returns an object containing information about the context of the load operation. |
|  | GetLoadRequestId | Returns the load operation GUID. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace